In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, accuracy_score
from sklearn.naive_bayes import GaussianNB

In [6]:
df=pd.read_csv('titanic.csv')

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [9]:
target=df.Survived

In [11]:
df.isna().any()

Survived    False
Pclass      False
Sex         False
Age          True
Fare        False
dtype: bool

In [12]:
df.Age=df.Age.fillna(df.Age.mean())

In [13]:
df.isna().any()

Survived    False
Pclass      False
Sex         False
Age         False
Fare        False
dtype: bool

In [17]:
df.columns[df.isna().any()]

Index([], dtype='object')

In [18]:
df.drop('Survived',axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
dummies=pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [20]:
df=pd.concat([df,dummies], axis='columns')
df.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [21]:
df.drop('Sex',axis='columns', inplace=True)
df.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [31]:
X_train, X_test, y_train,y_test=train_test_split(df,target, test_size=0.2,random_state=100)

In [23]:
model=GaussianNB()
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [32]:
model.score(X_test,y_test)

0.7821229050279329

In [33]:
y_test[:10]

205    0
44     1
821    1
458    1
795    0
118    0
424    0
678    0
269    1
229    0
Name: Survived, dtype: int64

In [34]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 0, 1, 0, 1, 1, 1], dtype=int64)

In [35]:
model.predict_proba(X_test[:10])

array([[3.79589345e-02, 9.62041066e-01],
       [5.95460150e-02, 9.40453985e-01],
       [9.90426114e-01, 9.57388591e-03],
       [3.26922976e-02, 9.67307702e-01],
       [9.80569143e-01, 1.94308568e-02],
       [6.97626298e-09, 9.99999993e-01],
       [9.88943666e-01, 1.10563336e-02],
       [5.16202019e-02, 9.48379798e-01],
       [3.39707629e-05, 9.99966029e-01],
       [6.83850837e-02, 9.31614916e-01]])